<!DOCTYPE html>
<html lang="en-US" xml:lang="en" xmlns="http://www.w3.org/1999/xhtml">
	<head>
		<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1" />
		<title>Ma r&eacute;ponse &agrave; l'article "Software Should Be Easier To Build, Not Harder - My Dream For The Future Of Development"</title>
		<link rel="shortcut icon" href="/wwwroot/favicon.ico" />
		<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
        <meta name="language" content="fr" />
		<meta name="keywords" content="Microsoft" />
		<meta name="description" content="Ma r&eacute;ponse &agrave; l'article de David McCarter sur les tendances Microsoft, 'Software Should Be Easier To Build, Not Harder - My Dream For The Future Of Development'" />
		<meta name="author" content="Adrien Torris" />
		<meta name="robots" content="index,follow" />
		<meta name="generator" content="No404! 0.1" />
		<link rel="alternate" href="https://adrientorris.github.io/microsoft/response-to-post-software-should-be-easier-to-build-not-harder.html" hreflang="en-en" />
		<link rel="alternate" href="https://adrientorris.github.io/fr/microsoft/reponse-article-software-should-be-easier-to-build-not-harder.html" hreflang="fr-fr" />
		<link href="/wwwroot/css/style.css" rel="stylesheet" />
	</head>
	<body>
		<div id="main_ctn" class="post_ctn">
			<header>
				<div id="header-content">
					<h2>Blog</h2>
					<ul id="flags_wrapper">
						<li class="cur"><img src="/wwwroot/images/french.png" alt="" title="" /></li>
						<li><a href="https://adrientorris.github.io/microsoft/response-to-post-software-should-be-easier-to-build-not-harder.html" title=""><img src="/wwwroot/images/english.jpg" alt="" title="" /></a></li>
					</ul>
				</div>
			</header>
			<div id="arianne_wrapper">
				<ul>
					<li><a href="https://adrientorris.github.io/index.html" title="">Home</a></li>
					<li>Microsoft</li>
					<li class="active"><a href="https://adrientorris.github.io/fr/microsoft/reponse-article-software-should-be-easier-to-build-not-harder.html" title="Ma r&eacute;ponse &agrave; l'article 'Software Should Be Easier To Build, Not Harder - My Dream For The Future Of Development'">Ma r&eacute;ponse &agrave; l'article 'Software Should Be Easier To Build, Not Harder - My Dream For The Future Of Development'</a></li>
				</ul>
			</div>
			<div id="post_ctn">
				<h1>Ma r&eacute;ponse &agrave; l'article 'Software Should Be Easier To Build, Not Harder - My Dream For The Future Of Development'</h1>
				<p>Il y a quelques jours, l'architecte de la soci&eacute;t&eacute; dans laquelle je travaille m'a envoy&eacute; un lien avec comme commentaire <i>&quot;je trouve qu'il n'a pas tord&quot;</i>. Le lien en question est un article &eacute;crit par un MVP, post&eacute; sur <a href="http://www.c-sharpcorner.com/blogs/software-should-be-easier-to-build-not-harder-my-dream-for-the-future-of-development" title="Software Should Be Easier To Build, Not Harder - My Dream For The Future Of Development" rel="nofollow" target="_Blank">csharpcorner</a>, qui, pour r&eacute;sumer, explique que Microsoft va dans le mauvais sens en rendant les logiciels de plus en plus complexes &agrave; d&eacute;velopper (c'est tr&#200;s r&eacute;sum&eacute;, je vous conseille d'aller lire cet article si vous comptez aller au bout de celui-ci), mais l'id&eacute;e principale est l&agrave;.
</p><p>
Pour &#234;tre honn&#234;te, je n'ai jamais fait de Visual Basic, donc je ne sais pas exactement de quoi il parle quand il fait r&eacute;f&eacute;rence aux VBX par exemple, mais j'ai connu les diff&eacute;rentes solutions de "d&eacute;veloppement rapide" Microsoft, comme le Drag'n'Drop d'&eacute;l&eacute;ments en ASP.NET, ou les edmx, qu'il semble regretter, et je pr&eacute;f&#200;re de loin les solutions actuelles. De mon point de vue, les solutions permettant de d&eacute;velopper plus rapidement ont toujours fait perdre bien plus de temps qu'elles n'en faisaient gagner, car elles n'&eacute;taient efficaces qu'au sein d'un p&eacute;rim&#200;tre restreint, dans des cas simples bien identifi&eacute;s, et &eacute;taient complexes &agrave; adapter &agrave; des besoins sp&eacute;cifiques. Le drag'n'drop de composants et de sources de donn&eacute;es n'&eacute;taient r&eacute;ellement productifs que pour des applications basiques de lecture/&eacute;criture de grilles de donn&eacute;es. Une des id&eacute;es principales de son article et que le d&eacute;veloppement d'applications avec les outils Microsoft est d'une complexit&eacute; croissante au fil des ann&eacute;es, reproche fait &agrave; Microsoft que je trouve injuste. Tout d'abord, je me souviens de projets en ASP.NET o&#217; les projets de r&eacute;&eacute;criture/interpr&eacute;tation d'URL mobilisaient &agrave; eux-seuls des &eacute;quipes enti&#200;res, parfois pendant des semaines. Sur ce m&#234;mes projets, il fallait g&eacute;rer &eacute;norm&eacute;ment de probl&eacute;matiques purement techniques qui n'avaient finalement aucune raison d'&#234;tre, comme les postback, le poids des viewstate et j'en passe, autant de points d'attention sur lesquels il fallait garder une vigileance constante. Le MVC a &eacute;t&eacute; en soi une vraie r&eacute;volution, car parfaitement adapt&eacute; au d&eacute;veloppement web, il a enfin permit aux d&eacute;veloppeur de ne se concentrer que sur leur m&eacute;tier, &eacute;vitant ainsi d'&#234;tre pollu&eacute; par tout un tas de complications sans aucune valeur ajout&eacute;e fonctionnelle. ASP.NET Core a continu&eacute; dans cette direction en repensant le socle et proposant des briques techniques simplifiant consid&eacute;rablement le travail du d&eacute;veloppeur, le module d'injection de d&eacute;pendance en est le meilleur exemple.
</p><p>
Certes, la plupart des applications sont plus difficiles &agrave; d&eacute;velopper aujourd'hui qu'hier, mais le contexte n'est plus du tout le m&#234;me qu'il y a 30 ans. Est-ce la faute de Microsoft si aujoud'hui, la plupart des visites web ont lieu depuis des smatphones, qui ont tous leurs caract&eacute;ristiques propres ? Est-ce la faute de Microsoft si le parc hardware s'est consid&eacute;rablement enrichi, augmentant de mani&#200;re importante la complexit&eacute; d'un projet les adressant tous ? D'ailleurs, si c'est Microsoft qui &eacute;tait incomp&eacute;tent et allait dans le mauvais sens, une solution miracle aurait d&eacute;j&agrave; vu le jour, ce qui n'est pas le cas. Je trouve qu'il a raison quand il dit que Microsoft s'&eacute;loigne progressivement, depuis plusieurs ann&eacute;es, du RAD (Rapid Application Development), mais est-ce une erreur ? Personnelement je ne pense pas, bien au contraire. Les outils de Rapid Application Development amenaient toujours avec elles leur lot de contraintes et de limites, alors que les solutions actuelles vous permettent de b&#194;tir exactement ce dont vous avez besoin. Il regrette les EDMX, alors que le model builder d'Entity Framework Core est tellement puissant. Certes, il ne fait pas de sch&eacute;ma et ne permet pas de mod&eacute;liser un mod&#200;le de donn&eacute;es uniquement avec des clics gauche/clic droits souris, mais il est &agrave; l'image des outils de d&eacute;veloppement Microsoft d'aujourd'hui, il vous permet de faire exactement ce que vous voulez, &agrave; condition de le ma&#238;triser. Pour un sch&eacute;ma, il faudra aller voir ailleurs, mais il n'est pas fait pour &#199;a, et pour ma part je trouve qu'un sch&eacute;ma n'a rien &agrave; faire l&agrave;. Avec les outils de d&eacute;veloppement de Microsoft aujourd'hui, vous partez d'une page blanche, certes, mais vous allez o&#217; vous avez envie d'aller, de la mani&#200;re qui vous pla&#238;t. 
</p><p>
David McCarter termine son article en pointant du doigt la qualit&eacute; de la documentation, une documentation pourtant assez fournie, bien organis&eacute;e, et qui plus est open-source. Si vous lui trouvez un manque, vous &#234;tes libre de le combler, &agrave; quoi bon r&#194;ler ?
</p><p>
Moi aussi, mon r&#234;ve pour le futur du d&eacute;veloppement de logiciels est de voir na&#238;tre un outil permettant en quelques clics de souris de mettre au point un logiciel complexe, compatible google chrome/android/iphone/ipad/freebox/windows tablet/windows10/firefox/montres connect&eacute;es sans oublier les v&#234;tements connect&eacute;s mais &agrave; d&eacute;faut de cela, avoir des outils me permettant de d&eacute;veloper des logiciels en me concentrant uniquement sur les probl&eacute;matiques m&eacute;tiers, m&#234;me s'ils n&eacute;cessitent un peu de temps et de travail pour en comprendre le fonctionnement, est d&eacute;j&agrave; un bon d&eacute;but. Concernant l'outil du d&eacute;but de phrase, je n'ai absolument aucun espoir; D'une part, il est certain que le parc hardware n'en est qu'au d&eacute;but de sa diversification et continuera de consid&eacute;rablement se d&eacute;velopper et, d'autre part, je pense que comme c'est le cas avec les Hommes, les outils qui font tout, rapidement qui plus est, le font toujours mal.</p>
				<div id="crdny">09 Janvier 2017</div>
				<div id="tags_wrapper">
					<ul>
						<li>Microsoft</li>
						<li>Technologies Microsoft</li>
					</ul>
				</div>
				<div id="refs_wrapper">
					<ul>
						<li><a href="http://www.c-sharpcorner.com/blogs/software-should-be-easier-to-build-not-harder-my-dream-for-the-future-of-development" title="Software Should Be Easier To Build, Not Harder - My Dream For The Future Of Development" rel="nofollow" target="_Blank">Article original</a></li>
						<li><a href="https://docs.microsoft.com/en-us/aspnet/core/" title="" target="_Blank">Documentation ASP.NET Core</a></li>
					</ul>
				</div>
            </div>
			<footer>
			</footer>
		</div>
		<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.6.2/jquery.min.js" type="text/javascript"></script>
		<script src="/wwwroot/js/Infra.js" type="text/javascript"></script>
		<link type="text/css" rel="stylesheet" href="/wwwroot/lib/highlight/styles/vs.css" />
		<script type="text/javascript" src="/wwwroot/lib/highlight/highlight.pack.js"></script>
		<script type="text/javascript">hljs.initHighlightingOnLoad();</script>
<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','https://www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-85948839-1', 'auto');
  ga('send', 'pageview');

</script>
	</body>
</html>